using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PokeDo.Menu
{
    internal static class PokeAscii
    {
        static Dictionary<string, string> asciiDict = new Dictionary<string, string>()
        {
            {"Bulbasaur", @"

　 　 　 　 　　　)ヽ,ﾍ､ヽﾍ z 　 　 ｀´
　　　　　　　　ノ＾N　,､_,､ _ｽ
　　　　　　,／', ' ,　ｿ 　　ソ｀＼
　 　 　　,//　　'／ 　　　　ゝ ､､ヽ
　 　 　　{｛　　〈　' ′　　　　〉 　 }
　 　　　人 ､　__ゝ 　 　　　ノ_ 　人
　 　　,ｲｊ　》ヾj 　 ｀ﾒ´￣｀ '´　Y 　<＼
　　　,l <! l. "" }　,-､､　ヮ ,, ,､、 ｌ 　ｌ　　ｌ
　 　 { 　　V 〈　{. いｌ ｖ　　{り,）} ヽ| v　!
　 　 }　　,ｲゝヽ, ｀ ´ 　､ ,　~´ ﾉ　<l､ 　{
　 　´＾＾´ ヽ '　｀ﾃ＝====‐弋　　ﾉ ＾＾｀
　 　 　 　 　｀ｖvゝ 　 　　　　ﾑvｖ′"},

            {"Ivysaur", @"
　　　　　　　　　　　　　　　ﾊ/｀＾(
　 　 　 　　　　　　　　　,r' 　ﾞﾂV〈
　 　 　 　 　 　　　　　/ 　 　丿 　ヽ
　 　 　 　 　　　　　　l 　　／ 　 　　}
　 　 　 　 　 　 　　　{ 　〃 　 　 　 l
　　　　　＜´ヽ'７ｰ,-､ゝ { 　 　 　　ﾉ/７／＞7ゝy､
　　　　ヽ二｀　ヾ ､li　∠ゝ､ ＿ ィ/ 　〃 　 ＿　'ニヽ
　　　　　く_ィ´　＝へ.　ﾑ‐v‐､r‐｀=＝〒""ヾ ヽ_ヽ＞
　　　　　 　 く／ ,,〃,,べ､'l､__,ﾄヽヽ_ヾ､> >､　ヽ>
　 　　　　　　ム〃L{ﾄ､ -┴ ┴ ─'ｰ'‐ｧ７´￣
　 　 　 　　　/　ゞ 　ﾚ' ｀ 　<ゝ v 　""　V＼
　　　　 　　/ ﾞ 　　　|　r ､ 　 ﾏ ｒ　,r１　|ノく>、
　 　 　 　　{ァ　l'' ﾑ,l　{　{ ; 　 　,:ｲ　} 　l 　 　!
　　　　 　　〉､__,{ 　〈　｀┴' ､ ,　ﾞ┴┘ 　〉　<)l
　 　 　 　 ﾑｒｖｖゝ､ｭ ヾYﾆ‐--=ﾆvゝ､ィ ﾑ-､ｽ!
　 　 　　　　　　　ﾑ-ｩ‐V｀￣￣￣´"},

            {"Venusaur", @"
　　　　　　　　　　　, -─-─｡-､ 　 _＿_
　　　　　_ .. -─- く ,､ﾍ‐＾‐7ｧ７／ ゝ' o｀ヽ
　　　<´ 　 　<ゝ ＿_ヾ＾V＾＾ﾌｱ‐-l７〃 フl　｝
　　　　ヽ´￣Z￣ v 　｀＞＜ r‐ﾚ' 　l ∠ 　ヽ}
　 　 　　_∠ __<> 　O /～「ﾚ'　　|∠ -‐　ﾆ/
　　　＜ヽ ヽ!　「「ト ､,{～<ヽ　ｌ|／二 三ヲ′
　 ∠二 ＿ヽ 　!i　r､l7～Z｀〃＿_,. ‐ｫ' -､
　　＜ノ ／テ＝ﾞｰ| l_＞'´￣｀ , -､く〃, 　ﾆゝ､
　　Ｚ ヽ∠/_//〃 ｨRﾉ ､ , 　 ヾ9ﾌ 〈=‐- ､==ﾆヽ
　　l／/7 ﾟ/ 　 　（(v⌒'ニ ニ｀i>, 　 ヽ＼ ll｀ヽ ニ!
　 　　'7ﾟ　{　/　。 ｀〉　/-‐,--‐' ヽ、丿。ヽﾄ､」_ﾄ､ゝ
　 　　j ﾟ 　V　｡　　《,､（＿＿,､,､ィ´ィ 　 　｡ ヽ.
　　　ﾑ-l7t{ ﾟ　｡　　ﾄ､二二二 -'´-‐へﾟ ｡ 　 }
　 　　　　　｀<X7‐ﾏ　　　∠-､_rゝ　　ﾑ-v-l7"},

            {"Charmander",@"
　 　 　 　 　　　　　　　　　＿_
　 　 　 　 　 　 　 　 　, '´ 　　｀ヽ
　 　 　 　 　 　 　　　/ｎヽ 　 　'n !
　 　　　　　　ﾉ〃 　 { {!１ 　　　l１|
　　　　　　／/ 　 　 | ゝ′ 　　｀' l
　　　　ﾉ'´　ム ｧ 　　ヽ 、 　､ ,　.ﾍ
　　　〈　ﾉﾚj ／ 　　　　｀iﾇﾆ=-く, 　＼
　 　　} ｛ 　V/　　　　　ﾉl.　　　/ 　 　 ＼
　 　 /　j 　〈　　　　　/　l.　　そノ ヽ. 　　＼
　　　｀ゞ､ _ｽ､ 　　　んゝヘ 　　　　　＼ , 　　ヽ
　　　　　　　ヽ丶､ 　　　　　〉､　　　　　/ 　 　　l
　　　　　　　　ヽ. ､｀ '' ｰ -y′ ゝ ､_ 　 { 　 　　∧
　 　　　　　　　　` ｰ 二 ‐（ 　 　イ　￣ ゝ __ ィ 　l
　 　 　 　 　　　　　　　　￣｀７´　!‐ '' ´　　　ﾑvｖ′
　 　 　 　 　　　　　　　　　　ﾑvｖ′"},

            {"Charmeleon", @"	　 　　　　　　　　ｚ-‐＝‐-､
　 　 　　　　　,／ z‐ﾞ｀ゝ=ﾆニ二_'' ｰ‐-　、
　 　 　　　　〃　ｱ-､_ン,,/ 　　　　｀丶､　　丶
　 　 　　　　7/""⌒ ー'´ 　 　 　 　 　 　ヽ 　　｀ﾄ、
　 　 　 　　　　 　_ 　 　 　 　 　 　 　　　　i　　　i i
　 　 　 　 　　　<ﾌ｀￣｀ヽ 　 　 　 　 　　　ｌ 　 　l ｌ
　 　 　 　 　 　∠ゝ/｀ｌ　　ヽ 　　　　　　ｌヽj_∧　j│
　 　 　 　 　 　 　ノ 　｀-､ 　 ＼ , -‐i弋ﾅ´ ｀‐ﾍ/│
　　　　　　　　／ 　 　 　 ト、 ／ 　　{ { 　,r ‐､ l　!
　　　　　　　　ﾄ, 　/｀ヽ 　ヽ_)′ 　　ｌ　ヽ {　　} ﾚ′
　　　　　　, ─'　｀ｰ┸' 　 　　-、　　ゝ__ゝヽ-' ﾉ
　 　 　 　〈､ r　＿＿　　　　,, 　ｌ 　 　 ノ　｀ア´
　　　　　　ヽ-'＾Y　ｌ ｀l ｲヽ､{. 　|-- ''´ 　, ｲ
　　　　　　　　　|{　ヽ | | 　 l 　 L.. -- '' 　 |_
　　　　　　　　　か-又ﾉ 　ﾉ　　ﾄ､ 　 　 　 　ﾍ
　　　　　　　　　｀￣´　　/ 　 　l　ゝ､＿__,ﾉ 　l､
　 　 　 　 　　　　　　　r｛ 　 　ﾉ 　 　 　　｀vV´
　　　　　　　　　　　　　＾〈,〉‐く〉"},
            {"Charizard", @"
　　　　　　　　　ノJ~｀ﾆス
　　　　　　　　　〉ヾヾ_ 　ﾌ
　　　　　　　　　ゝ、ゞj　ソrﾆﾆヽ 　 　 　　　くヽ＿
　　　 　 　 　 　/7 ヾヽ l 　lｵ　fl ﾄ､　　　　　　l r‐､＼
　　　 　 　 /ニ-､ヽ　＼ゝ　〉 　,l ﾄ」 ! 　 　 　 l l 　 ＼＼
　　　　　 //　　/| |. 　ｒニﾆ⌒d/ 　ｽ＼ 　 　//|　ﾉ人＼＼
　　　 　〃 　 　!│| 　　　ゞﾆシ 　i' ｀ヽｲ 　//　| Z　j＾ゝ｀ｌ.ｌ
　　　 ,〃 　 　 |　| ヽ 　 　 　| 　　| 　＿_／/ 　 | 7 ｿ　そ ｌ.ｌ
　　. 〃 　 　 　| 　＼ ｀ ー ､j 　 　ﾚ´r─‐'´ 　ｎj { 」 　ﾑ｝ｌ.ｌ
　　〃 　＿　_ｂｄ､＿__>ｰ/´ 　　　∨‐-､_,r‐P｀'ｂ じ「!_ハｌ.ｌ
　　!ﾚ'´ 　　｀ｂ､　く_,r′ 　 　＿_ 　 ヽ ___｀ｰ'_⊆ﾉ　ﾉ | 　〃
　　　 　 　 　 　｀ ｰ-‐ /´／´　　｀＼ ; ＼二´＿_ノ　/
　　　 　　　　　, -─ｧｲ,/ 　 　 　 　　', 　 ｀＼＿＿ノ
　　　 　 　　／ 　／　{｛ 　 　 　 　　　} 　　　,〉─'´
　　　 　 　,〈　　（ 　　ヽゝ 　 　 　　　ﾉ　== <__
　　　 　 　ヽニZ > == ノ ｀ｰ --- ‐く_,ﾍ_ｨﾆゝ'´
　　　　　　　　　｀ｳ‐ﾜ′ 　 　 　 　 　｀´" },

            {"Squirtle",@"
	　 　 　 　 　 　 　 　 　 　　,. '´ ￣ ｀丶
　 　 　 　 　 　 　 　　　　/　　　　　　　l.
　 　 　 　 　 　 　 　 　 　ｌh 　　lﾃｌi 　 　!
　 　 　 　 　 　 　 　　　　|lj 　　ｌ__ｌ」　　,!
　 　 　 　 　 　 　 　 　　< ､ , ＿__, 　 ノ
　 　 　 　　　　　　　　＿_＞ｰｎ‐-=ニ>､
　 　 　　　, -‐- <´￣ 　 　 　j ｌ　　　∨ｌ.ヽ
　　　　　/　r‐ 、 レ‐-t‐ｎt‐'_ハ＿＿}__! 　ヽ、
　 　 　　{ 　し　! 　l. 　ﾚ'ｌ_|_｀ ／ 　　/　jｖ-､rﾍ、
　　　　　ヽ､__,ノ 　 ヽ__V´ __「ヽ､_,／ヽ/ 　∧　ｱ
　 　　　　　｀丶 ､..＿ 　ヽ_> 　 　ヽ_∠.. _ 　 　/
　 　 　 　　　　　　　　￣｀丶､＿ノ´ 　　　｀ー'"},

            {"Wartortle", @"
　 　 　　　　　　　　　　　∩
　　　　　〈｀ヽ.　　＿_ 　「ｌ｜
　 　 　　　〉ヽヽ'´　　｀ヾ､ |
　 　 　 　〈 　} 〉､ 　 　　,Y
　 　 　 　　yﾉ/｛ tiヽ　ｲｊ |
　 　 　 　　7´ =｀-' ､, ﾞ‐'=〉
　 　 ｃｎ-─>｀ｰv＝-‐ﾃくヽ、 , '⌒ヽ
　 　ヌ、 　/￣｀ｙ'´ 7⌒ヽ | ﾄ（　と く
　 　 　｀ y' 　　/ _ノ　　,.ｲ ﾚl ） 　 　）
　　　　　ト､＿,!_(_ 　_∠..」 | ﾚ' 　ﾉ-く
　　　　　〉、 　{ 　￣ -‐くノ７′人_)　）
　　　　/ 　｀ く ｀ゝ（　　　|,/ 　´ 　,／
　 　 　〉 　 　厂＼_ヽ 　　〈_彡''""´
　 　 　｀ー ''´　　　｀し､_ｒ‐'"},

            {"Blastoise", @"
　 　 　 　 　 　 　{7⌒´￣｀ヽ⌒!
　 　 　 　 　　　,r' 　 ｰｔl二ヽ くﾘヽ｀＼ 　,--､
　　　　　　　　（ ｖ‐'＾　　　　　　}　ﾍ 　Y|`ｰ""l
　 　 　 　 　 　 ｀Y´￣｀`'⌒)　,/ 　 l　　l､__,/ﾞi
　　　　　　　　　, へ､＿＿ノ,／ 　 　l、 }　j 　j
　　　　　　　　　レｰ|｀ ー‐'´| 　 , ─､ ｀|‐｛　∧
　 　 　 　　　∠Ｏヽｊ 　 　 　r‐く ヽ　ﾞl　ﾄ､_ソ　〉
　 　 　 　 　（ﾆ〈 　 ﾄ‐==＝に)　） ） ,! / 　 　〈
　 　　　　　　｀‐'-ｲ |　　　　｀ー'ｰ'‐ｲ｀＼　　,ｲ
　 　　　　　　　　　| ト-====＝─/⌒ヽ.　Y ,/
　 　　　　　　　　　ゝ＼ 　 　　　/　　　ｽ　ﾚ'
　　　　　　　　　　〈 　　ゝt--‐〈　　　,/　V
　 　 　 　 　 　 　　)__.ノ　｀ｙ─とー‐' 　/｀ヽ、
　　　　　　　　　∠＿ゝ､__,ﾑ　∠ゝ- ､ﾑー─'
　　　　　　　　　　　　￣　　　　　｀ー'´" },

            {"Geodude",@"
      .:......                       .::::        
     :. .....:.     .::.::.:.       :.:..  ..     
    ..  :. ....  ::::  :.   ::::.   : ....: ::.   
    ....:  ...  .:...  :.::.:. :..  ... .: .^:.   
        .:   :..^.::^...^^:.^:   :.   :.   ::     
         ..:  ...^ :......:.     .^. .:   :.      
          .....:....       ~.::. ..     ::        
                 .:.^..:.:::.:   ........         
                  ..:...:. .:.       ..           
                                                  "},

            {"Brock", @"
　　　　　　　　　 i＼ ／＼_ - 'l
　　　　　　　 ､ｰ'　　　　　　 　|＿
　　　　　　　--'　　　　　　　　　 /
　　　　　　 ＞　 /l/|/∨ヽlV､　/_
　　　　　　 ＼　l ｰ-､　 , -ｰ l　／
　　　　　　　　 kj ￣　 　 ￣ rl
.　　　　　　 　　､l　　　'　　　ﾚ
　　　　　　　 　　 ＼　￣ ／
　　　　　　　　　_/´l　￣ j´＼_
　　　　　　 イ／＿__＼／__,､_＼ ｰ､
　　　　　/ 　|　　　ヽ　^　/　　　|　 ヽ
　　　 　/　ヽ|　　　　i　 　i　 　　| /　|
　　　　/ 　､|ー----|　　 |-----i／　|
　　　 /　 　|　　　 　|　　 |　　　　|　 　l
　　　 7､＿ |　　　　|　　　|　　　　|　___|
　　 　/　　l7　　　 |　　 　|　　　　|´ 　 ､
　　　､　　 ､j　　　 l 　　 /|　　　　|,　 　}
　　　 ヽ 　ヽ ｰ､　/　 ／　|　　∠/　　/
　　　　ヽ 　ヽ　　/ヽ､__　　|　　 /　　/"},

            {"Oak", @"
                     :7!~^^^^^^^:.                          
                   ::7Y~.~777777!!?7~:                      
                   !5Y~ .~!7: .::~~:~J!                     
                    ~5J??7?JJ?5PJY5Y~JB                     
                    .~5@J^!77YJ77?JP#PY                     
                     775G#G5J77J5P&B55Y                     
                     5?B7^^Y577PY~?JP55                     
                      ^Y5^.::!?7777JY^                      
                     ..^J5?J55PGP557~ .                     
                   .~?J??YB&&BPG#@#P55J~!.                  
                  .P7.!7^GB5BBPP#@@B?Y?:~J7                 
          :.:!?7:^??!.~7^~GBG#&##&B!!7~ ^557                
        .JJ#GJG#GY. G!7~  5&BBGG#@5  ^?~B^~5?               
        :YY@5#YPG&Y~B! 7~ 5&BB###@5 ~7.:Y?.:P:              
         .5JY5P55P?BG^ .7^5@@@@@@@5^7.  ~B  ^G.             
         .??G?JP7B5!?^  .!B@@@@@@@B!.   ~B...7J.            
           ^B@GJJ!!Y^     5@@@@@@@5     ~#^^^7B.            
            .77JJY?#7:::. 5@BGGB&@5 .:::7#!7JP.             
               ... B?^^J~ 5BPGP5YBP ^J^^7&Y7!.              
                   B~  ?~ 5B#BYYYBP ~?  ~B.                 
                   B!  ?~ 5#B&GYYBP ~?  ~B                  
                   BJ^:!: 5BYBBYYBP ^?:^JB                  
                   ^?JJ7!!PGYBBYYPP!7?JJ?^                  
                     JBGPP5YYBBYYY5PPPBG                    
                     ~GBG5Y5BJYBYPBBGPG:                    
                    75Y?JB&B&P?PG5JJYBG.                    
                    ?YJJY5PYJ7.~55JJY55!                    
                     :^^^:^.    .^^^^^:                     "}

        };

        public static void ShowAscii(string name)
        {
            Console.WriteLine();

            for (int i = 0; i < asciiDict.Count; i++)
            {
                if (name == asciiDict.ElementAt(i).Key)
                {
                    Console.WriteLine(asciiDict.ElementAt(i).Value);
                }
            }
        }
    }
}
